ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/mtb-hal-cat1/source/cyhal_adc.c
/***************************************************************************/ /**
* \file cyhal_adc.c
*
* \brief
* Provides a high level interface for interacting with the Cypress Analog/Digital
* convert. This interface abstracts out the chip specific details. If any chip
* specific functionality is necessary, or performance is critical the low level
* functions can be used directly.
*
********************************************************************************
* \copyright
* Copyright 2018-2021 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

/**
 * \addtogroup group_hal_impl_adc ADC (Analog Digital Converter)
 * \ingroup group_hal_impl
 * \{
 * \section cyhal_adc_impl_features Features
 * The CAT1/CAT2 (PMG/PSoC 4/PSoC 6) ADC supports the following features:
 * * Resolution: 12 bit
 * * Only @ref CYHAL_POWER_LEVEL_DEFAULT and CYHAL_POWER_LEVEL_OFF are defined. The default power
 *   level will automatically adjust based on smple rate.
 * * Average counts: 2, 4, 8, 16, 32, 64, 128, 256
 * * Up to four unique acquisition times.
 * * DMA-based transfer when using @ref cyhal_adc_read_async. When using @ref cyhal_adc_read_async_uv,
 *   only interrupt-driven software copy is supported.
 * \} group_hal_impl_adc
 */

#include <cmsis_compiler.h>

#include "cyhal_adc.h"
#include "cyhal_analog_common.h"
#include "cyhal_clock.h"
#include "cyhal_dma.h"
#include "cyhal_gpio.h"
#include "cyhal_hwmgr.h"
#include "cyhal_utils.h"
#include "cyhal_interconnect.h"
#include "cyhal_syspm.h"
#include "cyhal_system.h"
#include <string.h>

#if defined(CY_IP_MXS40PASS_SAR_INSTANCES)
#define _CYHAL_ADC_SAR_INSTANCES CY_IP_MXS40PASS_SAR_INSTANCES
#elif defined(CY_IP_M0S8PASS4A_INSTANCES)
#define _CYHAL_ADC_SAR_INSTANCES CY_IP_M0S8PASS4A_INSTANCES
#endif

#if defined(_CYHAL_ADC_SAR_INSTANCES)

#if defined(__cplusplus)
extern "C"
{
#endif

// The PDL for M0S8 PASS doesn't take the register as an argument; it always writes to MUX_SWITCH0
#if defined(CY_IP_M0S8PASS4A_INSTANCES)
    #define _CYHAL_ADC_SARSEQ_STATE(state) (state)
    #define _CYHAL_ADC_SWITCH_STATE(state) (state)
    #define _CYHAL_ADC_SET_SWITCH(base, mask, state) Cy_SAR_SetAnalogSwitch((base), (mask), (state))
#else
    #define _CYHAL_ADC_SWITCH_STATE(state) ((state) ? CY_SAR_SWITCH_CLOSE : CY_SAR_SWITCH_OPEN)
    #define _CYHAL_ADC_SARSEQ_STATE(state) ((state) ? CY_SAR_SWITCH_SEQ_CTRL_ENABLE : CY_SAR_SWITCH_SEQ_CTRL_DISABLE)
    #define _CYHAL_ADC_SET_SWITCH(base, mask, state) Cy_SAR_SetAnalogSwitch((base), CY_SAR_MUX_SWITCH0, (mask), _CYHAL_ADC_SWITCH_STATE((state)))
#endif

static SAR_Type *const _cyhal_adc_base[] =
{
#if (CY_IP_MXS40PASS_SAR_INSTANCES == 1)
    SAR,
#else
#if (_CYHAL_ADC_SAR_INSTANCES >= 1)
    SAR0,
#endif
#if (_CYHAL_ADC_SAR_INSTANCES >= 2)
    SAR1,
#endif
#if (_CYHAL_ADC_SAR_INSTANCES >= 3)
    #warning Unhandled SAR instance count
#endif
#endif
};

static const en_clk_dst_t _cyhal_adc_clock[] =
{
#if (CY_IP_MXS40PASS_SAR_INSTANCES == 1)
    PCLK_PASS_CLOCK_SAR,
#elif (CY_IP_M0S8PASS4A_INSTANCES == 1)
    PCLK_PASS0_CLOCK_SAR,
#elif (CY_IP_MXS40PASS_SAR_INSTANCES == 2)
    PCLK_PASS_CLOCK_SAR0,
    PCLK_PASS_CLOCK_SAR1,
#elif (CY_IP_M0S8PASS4A_INSTANCES == 2)
    PCLK_PASS0_CLOCK_SAR,
    PCLK_PASS1_CLOCK_SAR,
#else
    #warning Unhandled SAR instance count
#endif
};

static const cyhal_source_t _cyhal_adc_tr_out[] =
{
#if (CY_IP_MXS40PASS_SAR_INSTANCES == 1)
    CYHAL_TRIGGER_PASS_TR_SAR_OUT,
#elif (CY_IP_M0S8PASS4A_INSTANCES == 1)
    CYHAL_TRIGGER_PASS0_TR_SAR_OUT,
#elif (CY_IP_MXS40PASS_SAR_INSTANCES == 2)
    CYHAL_TRIGGER_PASS_TR_SAR_OUT0,
    CYHAL_TRIGGER_PASS_TR_SAR_OUT1,
#elif (CY_IP_M0S8PASS4A_INSTANCES == 2)
    CYHAL_TRIGGER_PASS0_TR_SAR_OUT,
    CYHAL_TRIGGER_PASS1_TR_SAR_OUT,
#else
    #warning Unhandled SAR instance count
#endif
};

static const cyhal_dest_t _cyhal_adc_tr_in[] =
{
#if (CY_IP_MXS40PASS_SAR_INSTANCES == 1)
    CYHAL_TRIGGER_PASS_TR_SAR_IN,
#elif (CY_IP_M0S8PASS4A_INSTANCES == 1)
    CYHAL_TRIGGER_PASS0_TR_SAR_IN,
#elif (CY_IP_MXS40PASS_SAR_INSTANCES == 2)
    CYHAL_TRIGGER_PASS_TR_SAR_IN0,
    CYHAL_TRIGGER_PASS_TR_SAR_IN1,
#elif (CY_IP_M0S8PASS4A_INSTANCES == 2)
    CYHAL_TRIGGER_PASS0_TR_SAR_IN,
    CYHAL_TRIGGER_PASS1_TR_SAR_IN,
#else
    #warning Unhandled SAR instance count
#endif
};

static cyhal_adc_t* _cyhal_adc_config_structs[_CYHAL_ADC_SAR_INSTANCES];

static const IRQn_Type _cyhal_adc_irq_n[] =
{
#if (CY_IP_MXS40PASS_SAR_INSTANCES == 1)
    pass_interrupt_sar_IRQn,
#elif (CY_IP_M0S8PASS4A_INSTANCES == 1)
    pass_0_interrupt_sar_IRQn,
#elif (CY_IP_MXS40PASS_SAR_INSTANCES == 2)
    pass_interrupt_sar_0_IRQn,
    pass_interrupt_sar_1_IRQn,
#elif (CY_IP_M0S8PASS4A_INSTANCES == 2)
    pass_0_interrupt_sar_IRQn,
    pass_0_interrupt_sar_IRQn,
#else
    #warning Unhandled SAR instance count
#endif
};

static uint8_t _cyhal_adc_get_block_from_irqn(IRQn_Type irqn)
{
    switch (irqn)
    {
#if (CY_CPU_CORTEX_M4 || CY_IP_M0S8PASS4A_INSTANCES) // M0S8 only has one processor, a CM0 variant
#if (CY_IP_MXS40PASS_SAR_INSTANCES == 1)
    case pass_interrupt_sar_IRQn:
        return 0;
#elif (CY_IP_M0S8PASS4A_INSTANCES == 1)
    case pass_0_interrupt_sar_IRQn:
        return 0;
#elif (CY_IP_MXS40PASS_SAR_INSTANCES == 2)
    case pass_interrupt_sar_0_IRQn:
        return 0;
    case pass_interrupt_sar_1_IRQn:
        return 1;
#elif (CY_IP_M0S8PASS4A_INSTANCES == 2)
    case pass_0_interrupt_sar_IRQn:
        return 0;
    case pass_1_interrupt_sar_IRQn:
        return 1;
#else
    #warning Unhandled SAR instance count
#endif
#endif /* (CY_CPU_CORTEX_M4 || CY_IP_M0S8PASS4A_INSTANCES) */
    default:
        CY_ASSERT(false); // Should never be called with a non-SAR IRQn
        return 0;
    }
}

#if defined(CY_IP_MXS40PASS_SAR_INSTANCES)
/* OR in the following user-configurable values: vref, bypass, vneg, */
#define _CYHAL_ADC_DEFAULT_CTRL ((uint32_t)CY_SAR_VREF_PWR_100 | (uint32_t)CY_SAR_VREF_SEL_BGR \
                                | (uint32_t)CY_SAR_BYPASS_CAP_DISABLE | (uint32_t)CY_SAR_CTRL_NEGVREF_HW \
                                | (uint32_t)CY_SAR_CTRL_COMP_DLY_12   | (uint32_t)CY_SAR_COMP_PWR_100 \
                                | (uint32_t)CY_SAR_DEEPSLEEP_SARMUX_OFF | (uint32_t)CY_SAR_SARSEQ_SWITCH_ENABLE)

/* Default configuration. OR in the average count, and average mode */
#define _CYHAL_ADC_DEFAULT_SAMPLE ((uint32_t)CY_SAR_RIGHT_ALIGN | (uint32_t)CY_SAR_TRIGGER_MODE_FW_ONLY \
                                 | (uint32_t)CY_SAR_SINGLE_ENDED_SIGNED | (uint32_t)CY_SAR_DIFFERENTIAL_SIGNED \
                                 | (uint32_t)CY_SAR_TRIGGER_MODE_FW_ONLY)

static const cy_stc_sar_config_t _CYHAL_ADC_DEFAULT_PDL_CONFIG =
{
    /* .ctrl is populated from _CYHAL_ADC_DEFAULT_CTRL plus the user's configuration */
    /* .sampleCtrl is puopulated from _CYHAL_ADC_DEFAULT_SAMPLE plus the user's configuration */
    .sampleTime01 = (10UL << SAR_SAMPLE_TIME01_SAMPLE_TIME0_Pos), // Sample times 1, 2, and 3 are not used
    .sampleTime23 = 0UL,
    .rangeThres = (0UL << CY_SAR_RANGE_HIGH_SHIFT) | (0UL << CY_SAR_RANGE_LOW_SHIFT),
    .rangeCond = CY_SAR_RANGE_COND_BELOW,
    .chanEn = 0UL,
    .chanConfig = { 0UL, 0UL, 0UL, 0UL, 0UL, 0UL, 0UL, 0UL, 0UL, 0UL, 0UL, 0UL, 0UL, 0UL, 0UL, 0UL},
    .intrMask = (uint32_t) CY_SAR_INTR_EOS,
    .satIntrMask = 0UL,
    .rangeIntrMask = 0UL,
    .muxSwitch = 0UL,
    .muxSwitchSqCtrl = 0UL,
    .configRouting = true,
    /* .vrefMvValue is populated from the user's configuration */
};

#endif

#define _CYHAL_ADC_RESOLUTION 12u
#define _CYHAL_ADC_INTERNAL_VREF_MV 1200UL
#define _CYHAL_ADC_CONVERSION_CYCLES (_CYHAL_ADC_RESOLUTION + 2)

static const cyhal_adc_config_t _CYHAL_ADC_DEFAULT_CONFIG =
{
    .resolution          = _CYHAL_ADC_RESOLUTION,
    .average_count       = 1,
    .average_mode_flags  = CYHAL_ADC_AVG_MODE_AVERAGE,
    .continuous_scanning = true,
    .vneg                = CYHAL_ADC_VNEG_VREF,
    .vref                = CYHAL_ADC_REF_INTERNAL,
    .ext_vref            = NC,
    .ext_vref_mv         = 0u,
    .is_bypassed         = false,
    .bypass_pin          = NC,
};

