ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/mtb-hal-cat1/source/cyhal_adc.c
/*******************************************************************************
*       Internal helper functions
*******************************************************************************/
static uint8_t _cyhal_adc_max_configured_channel(const cyhal_adc_t* obj)
{
    uint8_t max = 0;
    for(uint8_t i = 0; i < CY_SAR_SEQ_NUM_CHANNELS; ++i)
    {
        if(NULL != obj->channel_config[i])
        {
            max = i;
        }
    }
    return max;
}

static uint32_t _cyhal_adc_get_mux_switch_control(cyhal_gpio_t gpio)
{
    static const uint32_t mux_lookup[] =
    {
#if defined(CY_IP_M0S8PASS4A_INSTANCES)
        SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_P0_Msk,
        SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_P1_Msk,
        SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_P2_Msk,
        SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_P3_Msk,
        SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_P4_Msk,
        SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_P5_Msk,
        SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_P6_Msk,
        SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_P7_Msk,
#else
        (uint32_t)CY_SAR_MUX_SQ_CTRL_P0,
        (uint32_t)CY_SAR_MUX_SQ_CTRL_P1,
        (uint32_t)CY_SAR_MUX_SQ_CTRL_P2,
        (uint32_t)CY_SAR_MUX_SQ_CTRL_P3,
        (uint32_t)CY_SAR_MUX_SQ_CTRL_P4,
        (uint32_t)CY_SAR_MUX_SQ_CTRL_P5,
        (uint32_t)CY_SAR_MUX_SQ_CTRL_P6,
        (uint32_t)CY_SAR_MUX_SQ_CTRL_P7
#endif
    };
    uint8_t pin = CYHAL_GET_PIN(gpio);
    CY_ASSERT(pin < sizeof(mux_lookup)/sizeof(mux_lookup[0]));
    return mux_lookup[pin];
}

static uint32_t _cyhal_adc_get_fw_switch_control(cyhal_gpio_t gpio, bool is_vplus)
{
    static const uint32_t vplus_lookup[] =
    {
        (uint32_t)CY_SAR_MUX_FW_P0_VPLUS,
        (uint32_t)CY_SAR_MUX_FW_P1_VPLUS,
        (uint32_t)CY_SAR_MUX_FW_P2_VPLUS,
        (uint32_t)CY_SAR_MUX_FW_P3_VPLUS,
        (uint32_t)CY_SAR_MUX_FW_P4_VPLUS,
        (uint32_t)CY_SAR_MUX_FW_P5_VPLUS,
        (uint32_t)CY_SAR_MUX_FW_P6_VPLUS,
        (uint32_t)CY_SAR_MUX_FW_P7_VPLUS
    };

    static const uint32_t vminus_lookup[] =
    {
        (uint32_t)CY_SAR_MUX_FW_P0_VMINUS,
        (uint32_t)CY_SAR_MUX_FW_P1_VMINUS,
        (uint32_t)CY_SAR_MUX_FW_P2_VMINUS,
        (uint32_t)CY_SAR_MUX_FW_P3_VMINUS,
        (uint32_t)CY_SAR_MUX_FW_P4_VMINUS,
        (uint32_t)CY_SAR_MUX_FW_P5_VMINUS,
        (uint32_t)CY_SAR_MUX_FW_P6_VMINUS,
        (uint32_t)CY_SAR_MUX_FW_P7_VMINUS
    };

    uint8_t pin = CYHAL_GET_PIN(gpio);
    CY_ASSERT(pin < sizeof(vplus_lookup)/sizeof(vplus_lookup[0]));
    return (uint32_t)(is_vplus ? vplus_lookup[pin] : vminus_lookup[pin]);
}

#if defined(CY_IP_M0S8PASS4A_INSTANCES)
static uint32_t _cyhal_adc_get_pin_addr(cyhal_gpio_t gpio)
{
    // On this version of the PASS, there is no explicit vminus address; it is implied by vplus
    static const cy_en_sar_chan_config_port_pin_addr_t vplus_lookup[] =
    {
        CY_SAR_ADDR_SARMUX_0,
        CY_SAR_ADDR_SARMUX_1,
        CY_SAR_ADDR_SARMUX_2,
        CY_SAR_ADDR_SARMUX_3,
        CY_SAR_ADDR_SARMUX_4,
        CY_SAR_ADDR_SARMUX_5,
        CY_SAR_ADDR_SARMUX_6,
        CY_SAR_ADDR_SARMUX_7
    };
    uint8_t pin = CYHAL_GET_PIN(gpio);
    CY_ASSERT(pin < sizeof(vplus_lookup)/sizeof(vplus_lookup[0]));
    return (uint32_t)vplus_lookup[pin];
}
#else
static uint32_t _cyhal_adc_get_pin_addr(cyhal_gpio_t gpio, bool is_vplus)
{
    static const cy_en_sar_chan_config_pos_pin_addr_t vplus_lookup[] =
    {
        CY_SAR_CHAN_POS_PIN_ADDR_0,
        CY_SAR_CHAN_POS_PIN_ADDR_1,
        CY_SAR_CHAN_POS_PIN_ADDR_2,
        CY_SAR_CHAN_POS_PIN_ADDR_3,
        CY_SAR_CHAN_POS_PIN_ADDR_4,
        CY_SAR_CHAN_POS_PIN_ADDR_5,
        CY_SAR_CHAN_POS_PIN_ADDR_6,
        CY_SAR_CHAN_POS_PIN_ADDR_7
    };

    static const cy_en_sar_chan_config_neg_pin_addr_t vminus_lookup[] =
    {
        CY_SAR_CHAN_NEG_PIN_ADDR_0,
        CY_SAR_CHAN_NEG_PIN_ADDR_1,
        CY_SAR_CHAN_NEG_PIN_ADDR_2,
        CY_SAR_CHAN_NEG_PIN_ADDR_3,
        CY_SAR_CHAN_NEG_PIN_ADDR_4,
        CY_SAR_CHAN_NEG_PIN_ADDR_5,
        CY_SAR_CHAN_NEG_PIN_ADDR_6,
        CY_SAR_CHAN_NEG_PIN_ADDR_7
    };
    uint8_t pin = CYHAL_GET_PIN(gpio);
    CY_ASSERT(pin < sizeof(vplus_lookup)/sizeof(vplus_lookup[0]));
    uint32_t pin_addr = is_vplus ? (uint32_t)vplus_lookup[pin] : (uint32_t)vminus_lookup[pin];
    return is_vplus ? (pin_addr | CY_SAR_POS_PORT_ADDR_SARMUX) : (pin_addr | CY_SAR_NEG_PORT_ADDR_SARMUX);
}
#endif

static cy_en_sar_ctrl_vref_sel_t _cyhal_adc_convert_vref(cyhal_adc_vref_t vref)
{
    switch(vref)
    {
        case CYHAL_ADC_REF_INTERNAL:
            return CY_SAR_VREF_SEL_BGR;
        case CYHAL_ADC_REF_EXTERNAL:
            return CY_SAR_VREF_SEL_EXT;
        case CYHAL_ADC_REF_VDDA:
            return CY_SAR_VREF_SEL_VDDA;
        case CYHAL_ADC_REF_VDDA_DIV_2:
            return CY_SAR_VREF_SEL_VDDA_DIV_2;
        default:
            CY_ASSERT(false);
            return CY_SAR_VREF_SEL_BGR;
    }
}

static cy_rslt_t _cyhal_adc_convert_average_count(uint32_t hal_count, cy_en_sar_sample_ctrl_avg_cnt_t* pdl_count)
{
    switch(hal_count)
    {
        case 1: /* Average count of 1 is achieved by disabling averaging for all channels */
        case 2:
            *pdl_count = CY_SAR_AVG_CNT_2;
            return CY_RSLT_SUCCESS;
        case 4:
            *pdl_count = CY_SAR_AVG_CNT_4;
            return CY_RSLT_SUCCESS;
        case 8:
            *pdl_count = CY_SAR_AVG_CNT_8;
            return CY_RSLT_SUCCESS;
        case 16:
            *pdl_count = CY_SAR_AVG_CNT_16;
            return CY_RSLT_SUCCESS;
        case 32:
            *pdl_count = CY_SAR_AVG_CNT_32;
            return CY_RSLT_SUCCESS;
        case 64:
            *pdl_count = CY_SAR_AVG_CNT_64;
            return CY_RSLT_SUCCESS;
        case 128:
            *pdl_count = CY_SAR_AVG_CNT_128;
            return CY_RSLT_SUCCESS;
        case 256:
            *pdl_count = CY_SAR_AVG_CNT_256;
            return CY_RSLT_SUCCESS;
        default:
            return CYHAL_ADC_RSLT_BAD_ARGUMENT;
    }
}

static uint32_t _cyhal_adc_get_vref_mv(const cyhal_adc_config_t* hal_config)
{
    switch(hal_config->vref)
    {
        case CYHAL_ADC_REF_INTERNAL:
            return _CYHAL_ADC_INTERNAL_VREF_MV;
        case CYHAL_ADC_REF_EXTERNAL:
            CY_ASSERT(hal_config->ext_vref_mv > 0); // Should have been error checked already
            return hal_config->ext_vref_mv;
        case CYHAL_ADC_REF_VDDA_DIV_2:
            return cyhal_syspm_get_supply_voltage(CYHAL_VOLTAGE_SUPPLY_VDDA) / 2;
        default:
            CY_ASSERT(CYHAL_ADC_REF_VDDA == hal_config->vref);
            return cyhal_syspm_get_supply_voltage(CYHAL_VOLTAGE_SUPPLY_VDDA);
    }
}

