ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/mtb-hal-cat1/source/cyhal_adc.c
#if defined(CY_IP_M0S8PASS4A_INSTANCES)
static cy_rslt_t _cyhal_adc_convert_resolution(uint8_t hal_resolution, cy_en_sar_sample_ctrl_sub_resolution_t *pdl_resolution)
{
    switch(hal_resolution)
    {
        case 10:
            *pdl_resolution = CY_SAR_SUB_RESOLUTION_10B;
            break;
        case 8:
            *pdl_resolution = CY_SAR_SUB_RESOLUTION_8B;
            break;
        default:
            return CYHAL_ADC_RSLT_BAD_ARGUMENT;
    }

    return CY_RSLT_SUCCESS;
}

static void _cyhal_adc_extract_channel_conf(cyhal_adc_t* adc, cy_stc_sar_channel_config_t* channel_configs)
{
    for(uint8_t i = 0; i < CY_SAR_SEQ_NUM_CHANNELS; ++i)
    {
        channel_configs[i].addr  = (cy_en_sar_chan_config_port_pin_addr_t)_FLD2VAL(SAR_CHAN_CONFIG_PIN_ADDR, adc->base->CHAN_CONFIG[i]);
        channel_configs[i].addr |= (cy_en_sar_chan_config_port_pin_addr_t)_FLD2VAL(SAR_CHAN_CONFIG_PORT_ADDR, adc->base->CHAN_CONFIG[i]);

        channel_configs[i].avgEn         = _FLD2BOOL(SAR_CHAN_CONFIG_AVG_EN, adc->base->CHAN_CONFIG[i]);
        channel_configs[i].sampleTimeSel = _FLD2VAL(SAR_CHAN_CONFIG_SAMPLE_TIME_SEL, adc->base->CHAN_CONFIG[i]);
        channel_configs[i].differential  = _FLD2BOOL(SAR_CHAN_CONFIG_DIFFERENTIAL_EN, adc->base->CHAN_CONFIG[i]);
        channel_configs[i].resolution    = (cy_en_sar_channel_ctrl_resolution_t)_FLD2VAL(SAR_CHAN_CONFIG_RESOLUTION, adc->base->CHAN_CONFIG[i]);
    }
}

static cy_rslt_t _cyhal_adc_populate_pdl_config(const cyhal_adc_config_t* hal_config, cy_stc_sar_config_t* pdl_config,
                                                cy_stc_sar_channel_config_t* channel_configs /* Array, length CY_SAR_SEQ_NUM_CHANNELS */)
{
    memset(pdl_config, 0, sizeof(cy_stc_sar_config_t));

    cy_rslt_t result = CY_RSLT_SUCCESS;
    pdl_config->vrefSel = _cyhal_adc_convert_vref(hal_config->vref);
    pdl_config->vrefBypCapEn = hal_config->is_bypassed;
    pdl_config->negSel = (hal_config->vneg == CYHAL_ADC_VNEG_VSSA) ? CY_SAR_NEG_SEL_VSSA_KELVIN : CY_SAR_NEG_SEL_VREF;
    pdl_config->negVref = CY_SAR_NEGVREF_HW;
    pdl_config->boostPump = true;
    pdl_config->power = CY_SAR_NORMAL_PWR;
    pdl_config->sarMuxDsEn = false; // This only enables the routing in deepsleep, not the SAR. And we only use the routing with the SAR
    pdl_config->switchDisable = false; // We are using the SARSEQ
    if(hal_config->resolution != _CYHAL_ADC_RESOLUTION)
    {
        result = _cyhal_adc_convert_resolution(hal_config->resolution, &pdl_config->subResolution);
    }
    if(CY_RSLT_SUCCESS == result)
    {
        pdl_config->leftAlign = false;
        pdl_config->singleEndedSigned = true;
        pdl_config->differentialSigned = true;
        pdl_config->avgShift = true;
        result = _cyhal_adc_convert_average_count(hal_config->average_count, &pdl_config->avgCnt);
    }
    if(CY_RSLT_SUCCESS == result)
    {
        pdl_config->trigMode = CY_SAR_TRIGGER_MODE_FW_ONLY;
        pdl_config->eosEn = false;
        // Will be updated after configuration when we populate sample times after adding channels
        pdl_config->sampleTime0 = pdl_config->sampleTime1 = pdl_config->sampleTime2 = pdl_config->sampleTime3 = 10u;
        // Skipping range thresholds because we don't expose the range detect feature.
        // We always need to populate channel configuration structs here because otherwise the PDL will not
        // initialize the default gain value that the channels will need when and if we add them later.
        for(uint8_t i = 0; i < CY_SAR_SEQ_NUM_CHANNELS; ++i)
        {
            pdl_config->channelConfig[i] = &channel_configs[i];
        }
        // Routing will be configured and channels will be enabled as channels are added
        pdl_config->vrefMvValue = _cyhal_adc_get_vref_mv(hal_config);
    }
    return result;
}
#else
static uint32_t _cyhal_adc_convert_average_mode(uint32_t average_mode_flags)
{
    uint32 result = 0;
    if(0u != (average_mode_flags & CYHAL_ADC_AVG_MODE_ACCUMULATE))
    {
        result |= CY_SAR_AVG_MODE_SEQUENTIAL_ACCUM;
    }
    else if(0u != (average_mode_flags & CYHAL_ADC_AVG_MODE_INTERLEAVED))
    {
        /* INTERLEAVED on its own does not divide the result back down */
        result |= (CY_SAR_AVG_MODE_INTERLEAVED | SAR_SAMPLE_CTRL_AVG_SHIFT_Msk);
    }
    else
    {
        result |= CY_SAR_AVG_MODE_SEQUENTIAL_FIXED;
    }
    return result;
}

/* Populates the PDL config struct with settings from the ADC config struct */
static cy_rslt_t _cyhal_adc_populate_pdl_config(const cyhal_adc_config_t* hal_config, cy_stc_sar_config_t* pdl_config)
{
    memset(pdl_config, 0, sizeof(cy_stc_sar_config_t));
    if(hal_config->resolution != _CYHAL_ADC_RESOLUTION) /* SAR does not support configurable resolution */
    {
        return CYHAL_ADC_RSLT_BAD_ARGUMENT;
    }

    if (((hal_config->average_mode_flags & CYHAL_ADC_AVG_MODE_ACCUMULATE) > 0) &&
        ((hal_config->average_mode_flags & CYHAL_ADC_AVG_MODE_INTERLEAVED) > 0))
    {
        /* Accumulate mode is not compatible with interleaved averaging */
        return CYHAL_ADC_RSLT_BAD_ARGUMENT;
    }

    *pdl_config = _CYHAL_ADC_DEFAULT_PDL_CONFIG;
    uint32_t ctrl = _CYHAL_ADC_DEFAULT_CTRL;
    ctrl |= (uint32_t)_cyhal_adc_convert_vref(hal_config->vref);
    ctrl |= (hal_config->is_bypassed) ? CY_SAR_BYPASS_CAP_ENABLE : CY_SAR_BYPASS_CAP_DISABLE;
    ctrl |= (hal_config->vneg == CYHAL_ADC_VNEG_VSSA) ? CY_SAR_NEG_SEL_VSSA_KELVIN : CY_SAR_NEG_SEL_VREF;

    uint32_t sample_ctrl = _CYHAL_ADC_DEFAULT_SAMPLE;
    cy_en_sar_sample_ctrl_avg_cnt_t pdl_avg;
    cy_rslt_t result = _cyhal_adc_convert_average_count(hal_config->average_count, &pdl_avg);
    if(CY_RSLT_SUCCESS == result)
    {
        sample_ctrl |= (uint32_t)pdl_avg;
        sample_ctrl |= _cyhal_adc_convert_average_mode(hal_config->average_mode_flags);

        pdl_config->ctrl = ctrl;
        pdl_config->sampleCtrl = sample_ctrl;
        pdl_config->vrefMvValue = _cyhal_adc_get_vref_mv(hal_config);
    }
    return result;
}
#endif

static void _cyhal_adc_irq_handler(void)
{
    /* The only enabled event is scan finished */
    cyhal_adc_event_t hal_event = CYHAL_ADC_EOS;

