ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/mtb-hal-cat1/source/cyhal_adc.c
        obj->base = _cyhal_adc_base[adc_inst.block_num];
        pclk = (en_clk_dst_t)(_cyhal_adc_clock[adc_inst.block_num]);
        if (NULL != clk)
        {
            obj->clock = *clk;
            obj->dedicated_clock = false;
        }
        else if (CY_RSLT_SUCCESS ==
            (result = _cyhal_utils_allocate_clock(&(obj->clock), &(obj->resource), CYHAL_CLOCK_BLOCK_PERIPHERAL_16BIT, true)))
        {
            obj->dedicated_clock = true;
        }
    }

    if (CY_RSLT_SUCCESS == result)
    {
        if (CY_SYSCLK_SUCCESS != Cy_SysClk_PeriphAssignDivider(pclk, (cy_en_divider_types_t)obj->clock.block, obj->clock.channel))
            result = CYHAL_ADC_RSLT_FAILED_CLOCK;
    }

    if (CY_RSLT_SUCCESS == result)
    {
        if(obj->dedicated_clock)
        {
    #if defined(CY_IP_M0S8PASS4A_INSTANCES)
            uint32_t source_hz = Cy_SysClk_ClkSysGetFrequency();
    #else
            uint32_t source_hz = Cy_SysClk_ClkPeriGetFrequency();
    #endif
            uint32_t div = source_hz / DESIRED_DIVIDER;
            if (0 == div ||
                CY_SYSCLK_SUCCESS != Cy_SysClk_PeriphSetDivider((cy_en_divider_types_t)obj->clock.block, obj->clock.channel, div - 1) ||
                CY_SYSCLK_SUCCESS != Cy_SysClk_PeriphEnableDivider((cy_en_divider_types_t)obj->clock.block, obj->clock.channel))
            {
                result = CYHAL_ADC_RSLT_FAILED_CLOCK;
            }
        }
    }

    cy_stc_sar_config_t pdl_config;
#if defined(CY_IP_M0S8PASS4A_INSTANCES)
    cy_stc_sar_channel_config_t chan_configs[CY_SAR_SEQ_NUM_CHANNELS];
    memset(chan_configs, 0, sizeof(chan_configs));
    // No channels have actually been configured yet, so an empty set of config structs is fine here
    if (CY_RSLT_SUCCESS == result)
    {
        result = _cyhal_adc_populate_pdl_config(&_CYHAL_ADC_DEFAULT_CONFIG, &pdl_config, chan_configs);
    }
#else
    if (CY_RSLT_SUCCESS == result)
    {
        result = _cyhal_adc_populate_pdl_config(&_CYHAL_ADC_DEFAULT_CONFIG, &pdl_config);
    }
#endif

    if (result == CY_RSLT_SUCCESS)
    {
        result = (cy_rslt_t)Cy_SAR_Init(obj->base, &pdl_config);
    }

    if (result == CY_RSLT_SUCCESS)
    {
        Cy_SAR_SetVssaSarSeqCtrl(obj->base, _CYHAL_ADC_SARSEQ_STATE(true));
        Cy_SAR_SetVssaVminusSwitch(obj->base, _CYHAL_ADC_SWITCH_STATE(true));

        _cyhal_analog_init();

        _cyhal_adc_config_structs[obj->resource.block_num] = obj;
        cy_stc_sysint_t irqCfg = { _cyhal_adc_irq_n[obj->resource.block_num], CYHAL_ISR_PRIORITY_DEFAULT };
        Cy_SysInt_Init(&irqCfg, _cyhal_adc_irq_handler);
        NVIC_EnableIRQ(_cyhal_adc_irq_n[obj->resource.block_num]);

        /* We always need to listen to the EOS interrupt for internal bookkeeping */
        Cy_SAR_SetInterruptMask(obj->base, CY_SAR_INTR_EOS);
        Cy_SAR_Enable(obj->base);
    }
    else
    {
        cyhal_adc_free(obj);
    }
    return result;
}

void cyhal_adc_free(cyhal_adc_t *obj)
{
    if (NULL != obj && NULL != obj->base)
    {
        IRQn_Type irqn = _cyhal_adc_irq_n[obj->resource.block_num];
        NVIC_DisableIRQ(irqn);
        _cyhal_adc_config_structs[obj->resource.block_num] = NULL;

        cy_rslt_t rslt;
        rslt = cyhal_adc_disable_output(obj, CYHAL_ADC_OUTPUT_SCAN_COMPLETE);
        CY_ASSERT(CY_RSLT_SUCCESS == rslt);
        if (CYHAL_TRIGGER_CPUSS_ZERO != obj->source)
        {
            rslt = cyhal_adc_disconnect_digital(obj, obj->source, CYHAL_ADC_INPUT_START_SCAN);
            CY_ASSERT(CY_RSLT_SUCCESS == rslt);
        }
        (void)rslt; // Disable compiler warning in release build

        Cy_SAR_SetVssaSarSeqCtrl(obj->base, _CYHAL_ADC_SARSEQ_STATE(false));
        Cy_SAR_SetVssaVminusSwitch(obj->base, _CYHAL_ADC_SWITCH_STATE(false));
        Cy_SAR_Disable(obj->base);

        if(obj->dedicated_clock)
        {
            Cy_SysClk_PeriphDisableDivider((cy_en_divider_types_t)obj->clock.block, obj->clock.channel);
            cyhal_clock_free(&obj->clock);
        }

        _cyhal_analog_free();
#if defined(CY_IP_M0S8PASS4A_INSTANCES)
        _cyhal_utils_release_if_used(&(obj->ext_vref));
        _cyhal_utils_release_if_used(&(obj->bypass_pin));
#endif
        cyhal_hwmgr_free(&obj->resource);
        obj->base = NULL;
    }
}

cy_rslt_t _cyhal_adc_populate_acquisition_timers(cyhal_adc_t* obj)
{
    const uint32_t ACQUISITION_CLOCKS_MIN = 2;
    const uint32_t ACQUISITION_CLOCKS_MAX = 1023;

    cy_rslt_t result = CY_RSLT_SUCCESS;

    uint32_t clock_frequency_hz = cyhal_clock_get_frequency(&(obj->clock));
    uint32_t clock_period_ns = (clock_frequency_hz > 0)
        ? _CYHAL_UTILS_NS_PER_SECOND / clock_frequency_hz
        : 0;
    uint16_t sample_timer_ns[] = { 0u, 0u, 0u, 0u };
    uint8_t assigned_timer[CY_SAR_SEQ_NUM_CHANNELS];
    for(uint8_t channel = 0; channel < CY_SAR_SEQ_NUM_CHANNELS; ++channel)
    {
        cyhal_adc_channel_t* chan_config = obj->channel_config[channel];
        assigned_timer[channel] = 0u;
        /* If the channel isn't in use, what we select doesn't matter */
        if(NULL != chan_config)
        {
            bool found = false;
            for(uint8_t timer = 0; timer < sizeof(sample_timer_ns) / sizeof(sample_timer_ns[0]); ++timer)
            {
                if(chan_config->minimum_acquisition_ns == sample_timer_ns[timer])
                {
                    /* Matched a pre-existing timer; use that */
                    assigned_timer[channel] = timer;
                    found = true;
                    break;
                }
                else if(0 == sample_timer_ns[timer])
                {
                    /* Found a free timer - allocate and use that */
                    sample_timer_ns[timer] = chan_config->minimum_acquisition_ns;
                    assigned_timer[channel] = timer;
                    found = true;
                    break;
                }
            }

            if(false == found)
            {
                /* Ran out of acquisition timers */
                result = CYHAL_ADC_RSLT_BAD_ARGUMENT;
            }
        }
    }

    if(CY_RSLT_SUCCESS == result)
    {
        uint16_t sample_timer_clocks[sizeof(sample_timer_ns) / sizeof(sample_timer_ns[0])];
        for(uint8_t i = 0; i < sizeof(sample_timer_clocks) / sizeof(sample_timer_clocks[0]); ++i)
        {
            /* Convert from nanoseconds to clock cycles, rounding up */
            uint32_t clock_cycles = (sample_timer_ns[i] + (clock_period_ns - 1)) / clock_period_ns;
            if(clock_cycles < ACQUISITION_CLOCKS_MIN)
            {
                clock_cycles = ACQUISITION_CLOCKS_MIN;
            }
            else if(clock_cycles > ACQUISITION_CLOCKS_MAX)
            {
                clock_cycles = ACQUISITION_CLOCKS_MAX;
            }
            /* Per the register map, this should be one greater than the actual desired sampling cycle count */
            sample_timer_clocks[i] = clock_cycles + 1;
        }

        obj->base->SAMPLE_TIME01 = (sample_timer_clocks[0] << SAR_SAMPLE_TIME01_SAMPLE_TIME0_Pos)
                                 | (sample_timer_clocks[1] << SAR_SAMPLE_TIME01_SAMPLE_TIME1_Pos);
        obj->base->SAMPLE_TIME23 = (sample_timer_clocks[2] << SAR_SAMPLE_TIME23_SAMPLE_TIME2_Pos)
                                 | (sample_timer_clocks[3] << SAR_SAMPLE_TIME23_SAMPLE_TIME3_Pos);

        for(uint8_t i = 0; i < CY_SAR_SEQ_NUM_CHANNELS; ++i)
        {
            obj->base->CHAN_CONFIG[i] &= ~SAR_CHAN_CONFIG_SAMPLE_TIME_SEL_Msk;
            obj->base->CHAN_CONFIG[i] |= assigned_timer[i] << SAR_CHAN_CONFIG_SAMPLE_TIME_SEL_Pos;
        }
    }

    return result;
}

static const cyhal_resource_pin_mapping_t* _cyhal_adc_find_matching_resource(cyhal_resource_inst_t* adc, cyhal_gpio_t pin, const cyhal_resource_pin_mapping_t *pin_map, size_t count)
{
    for (uint32_t i = 0; i < count; i++)
    {
        if (pin == pin_map[i].pin && _cyhal_utils_resources_equal(adc, pin_map[i].inst))
        {
            return &pin_map[i];
        }
    }
    return NULL;
}

cy_rslt_t cyhal_adc_configure(cyhal_adc_t *obj, const cyhal_adc_config_t *config)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
#if defined(CYHAL_PIN_MAP_PASS_SAR_EXT_VREF0)
    if(NC != config->ext_vref)
    {
        // If this pin wasn't used in the previous config for either vref or bypass, reserve it
        if(NC == obj->ext_vref && config->ext_vref != obj->bypass_pin)
        {
            const cyhal_resource_pin_mapping_t* ext_vref_map =
                _cyhal_adc_find_matching_resource(&(obj->resource), config->ext_vref, cyhal_pin_map_pass_sar_ext_vref0,
                    sizeof(cyhal_pin_map_pass_sar_ext_vref0)/sizeof(cyhal_pin_map_pass_sar_ext_vref0[0]));

            if (NULL == ext_vref_map)
            {
                result = CYHAL_ADC_RSLT_BAD_ARGUMENT;
            }
            else
            {
                result = _cyhal_utils_reserve_and_connect(config->ext_vref, ext_vref_map);
            }

            if(CY_RSLT_SUCCESS == result)
            {
                obj->ext_vref = config->ext_vref;
            }
        }
    }
    else
    {
        if(NC != obj->ext_vref) // We used to have an external vref pin - free it
        {
            // If the same pin was used as bypass, mark it freed now too
            if(obj->ext_vref == obj->bypass_pin)
            {
                obj->bypass_pin = NC;
            }
            // It is okay to do this without checking if the pin is still used for bypass,
            // because in that case we will just re-reserve the pin below
            cyhal_gpio_free(obj->ext_vref);
            obj->ext_vref = NC;
        }

        // If external vref exists as a GPIO, it's an error to set vref to external without passing in the pin
        if(CYHAL_ADC_REF_EXTERNAL == config->vref)
        {
            result = CYHAL_ADC_RSLT_BAD_ARGUMENT;
        }
    }

    if(NC != config->bypass_pin)
    {
        if(CY_RSLT_SUCCESS == result)
        {
            // Bypass and ext_vref share the same hard-wired IO connection
            const cyhal_resource_pin_mapping_t* bypass_map =
                _cyhal_adc_find_matching_resource(&(obj->resource), config->bypass_pin, cyhal_pin_map_pass_sar_ext_vref0,
                    sizeof(cyhal_pin_map_pass_sar_ext_vref0)/sizeof(cyhal_pin_map_pass_sar_ext_vref0[0]));

            if (NULL == bypass_map)
            {
                result = CYHAL_ADC_RSLT_BAD_ARGUMENT;
            }
            else if(config->bypass_pin != config->ext_vref) // It's valid to use the same pin for both ext_vref and bypass
            {
                result = _cyhal_utils_reserve_and_connect(config->bypass_pin, bypass_map);
            }
        }

        if(CY_RSLT_SUCCESS == result)
        {
            obj->bypass_pin = config->bypass_pin;
        }
    }
    else
    {
        // We used to have an external vref pin - free it, unless it's still used for ext_vref
        if(NC != obj->bypass_pin && obj->ext_vref != obj->bypass_pin)
        {
            cyhal_gpio_free(obj->bypass_pin);
            obj->bypass_pin = NC;
        }

        // If bypass exists as a GPIO, it's an error to enable bypass without passing in the pin
        if(config->is_bypassed)
        {
            result = CYHAL_ADC_RSLT_BAD_ARGUMENT;
        }
    }
#else
    /* No GPIO pins for VREF - it must be using a dedicated pad */
    if(config->bypass_pin != NC || config->ext_vref != NC)
    {
        result = CYHAL_ADC_RSLT_BAD_ARGUMENT;
    }
#endif

    if(false == ((CYHAL_ADC_REF_EXTERNAL == config->vref) ^ (0u == config->ext_vref_mv)))
    {
        /* Must have exactly one of: ext vref selected, ext vref voltage unspecified */
        result = CYHAL_ADC_RSLT_BAD_ARGUMENT;
    }

    cy_stc_sar_config_t pdl_config;
#if defined(CY_IP_M0S8PASS4A_INSTANCES)
    if(CY_RSLT_SUCCESS == result)
    {
        obj->resolution = config->resolution;
        cy_stc_sar_channel_config_t chan_configs[CY_SAR_SEQ_NUM_CHANNELS];
        _cyhal_adc_extract_channel_conf(obj, chan_configs);
        result = _cyhal_adc_populate_pdl_config(config, &pdl_config, chan_configs);
    }
#else
    if(CY_RSLT_SUCCESS == result)
    {
        result = _cyhal_adc_populate_pdl_config(config, &pdl_config);
    }
#endif

    if(CY_RSLT_SUCCESS == result)
    {
        /* Save and restore channel configs */
        pdl_config.chanEn = obj->base->CHAN_EN;

        /* Don't deinit routing or change the channel config - we're going
         * to turn the SAR back on in a minute */
#if defined(CY_IP_M0S8PASS4A_INSTANCES)
        pdl_config.routingConfig = NULL;
#else
        pdl_config.configRouting = false;
        /* On M0S8 we already extracted the channel configuration as part
         * of assembling the PDL config struct. On MxS40 we need to do it here */
        for(uint8_t i = 0; i < CY_SAR_SEQ_NUM_CHANNELS; ++i)
        {
            pdl_config.chanConfig[i] = obj->base->CHAN_CONFIG[i];
        }
#endif
        result = (cy_rslt_t)Cy_SAR_Init(obj->base, &pdl_config);
        _cyhal_adc_populate_acquisition_timers(obj);
        Cy_SAR_SetInterruptMask(obj->base, CY_SAR_INTR_EOS);
        Cy_SAR_Enable(obj->base);
    }

