ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/mtb-hal-cat1/source/cyhal_adc.c
    if(obj->continuous_scanning)
    {
        obj->conversion_complete = false;
        Cy_SAR_StartConvert(obj->base, CY_SAR_START_CONVERT_CONTINUOUS);
    }
    else
    {
        Cy_SAR_StopConvert(obj->base);
    }

    return result;
}

cy_rslt_t cyhal_adc_set_power(cyhal_adc_t *obj, cyhal_power_level_t power)
{
    // The SAR doesn't have selectable power levels in the same way that the opamps do.
    if(CYHAL_POWER_LEVEL_OFF == power)
    {
        Cy_SAR_Disable(obj->base);
    }
    else
    {
        Cy_SAR_Enable(obj->base);
    }
    return CY_RSLT_SUCCESS;
}

static uint16_t _cyhal_adc_get_average_count(cyhal_adc_t* obj, int channel_idx)
{
    uint32_t average_count = 1;
    /* If averaging is in interleaved mode, it does not impact the sample time */
#if defined(CY_IP_MXS40PASS_SAR_INSTANCES)
    bool is_interleaved = CY_SAR_AVG_MODE_INTERLEAVED == (SAR_SAMPLE_CTRL(obj->base) & SAR_SAMPLE_CTRL_AVG_MODE_Msk);
#else
    bool is_interleaved = false;
#endif

    if(false == is_interleaved)
    {
        average_count = (SAR_SAMPLE_CTRL(obj->base) & SAR_SAMPLE_CTRL_AVG_CNT_Msk) >> SAR_SAMPLE_CTRL_AVG_CNT_Pos;
        average_count = (1uL << (average_count + 1uL));
    }

    return (obj->base->CHAN_CONFIG[channel_idx] & SAR_CHAN_CONFIG_AVG_EN_Msk) ? average_count : 1;
}

/* Gets acquisition times and conversion clocks for all enabled channels, factoring in averaging */
static void _cyhal_adc_get_sample_times(cyhal_adc_t* obj, uint32_t* min_acquisition_ns, uint32_t* conversion_clock_cycles)
{
    *min_acquisition_ns = *conversion_clock_cycles = 0;
    for(uint8_t i = 0; i < CY_SAR_SEQ_NUM_CHANNELS; ++i)
    {
        cyhal_adc_channel_t* chan_config = obj->channel_config[i];
        if(NULL != chan_config && (0u != (obj->base->CHAN_EN & 1 << i)))
        {
            uint32_t min_time = chan_config->minimum_acquisition_ns;
            uint8_t clock_cycles = _CYHAL_ADC_CONVERSION_CYCLES;
            uint16_t average_count = _cyhal_adc_get_average_count(obj, i);
            min_time *= average_count;
            clock_cycles *= average_count;

            *min_acquisition_ns += min_time;
            *conversion_clock_cycles += clock_cycles;
        }
    }
}

uint32_t _cyhal_adc_calc_optimal_clock_rate(cyhal_adc_t* obj, uint32_t target_sample_hz)
{
    /* From the architecture TRM */
    const uint32_t ADC_CLOCK_MAX_HZ = 60000000;
    const uint32_t ADC_CLOCK_MIN_HZ = 1000000;

    uint32_t sample_period_ns = _CYHAL_UTILS_NS_PER_SECOND / target_sample_hz;
    uint32_t total_acquisition_ns, conversion_clock_cycles;
    _cyhal_adc_get_sample_times(obj, &total_acquisition_ns, &conversion_clock_cycles);

    uint32_t conversion_budget_ns;
    if(sample_period_ns < total_acquisition_ns)
    {
        // Requested sampling rate is impossible - go as fast as we can.
        conversion_budget_ns = 1;
    }
    else
    {
        conversion_budget_ns = sample_period_ns - total_acquisition_ns;
    }

    uint32_t target_period_ns = conversion_budget_ns / conversion_clock_cycles;
    uint32_t target_clock_hz = _CYHAL_UTILS_NS_PER_SECOND / target_period_ns;
    if(target_clock_hz > ADC_CLOCK_MAX_HZ)
    {
        target_clock_hz = ADC_CLOCK_MAX_HZ;
    }
    else if(target_clock_hz < ADC_CLOCK_MIN_HZ)
    {
        target_clock_hz = ADC_CLOCK_MIN_HZ;
    }

    return target_clock_hz;
}

uint32_t _cyhal_adc_compute_actual_sample_rate(cyhal_adc_t* obj)
{
    /* Assumes that the acquisition timers and clock frequency are already set */
    uint32_t clock_frequency_hz = cyhal_clock_get_frequency(&obj->clock);
    uint32_t clock_period_ns = (clock_frequency_hz > 0)
        ? _CYHAL_UTILS_NS_PER_SECOND / clock_frequency_hz
        : 0;
    uint16_t sample_timer[] =
    {
        (obj->base->SAMPLE_TIME01 & SAR_SAMPLE_TIME01_SAMPLE_TIME0_Msk) >> SAR_SAMPLE_TIME01_SAMPLE_TIME0_Pos,
        (obj->base->SAMPLE_TIME01 & SAR_SAMPLE_TIME01_SAMPLE_TIME1_Msk) >> SAR_SAMPLE_TIME01_SAMPLE_TIME1_Pos,
        (obj->base->SAMPLE_TIME23 & SAR_SAMPLE_TIME23_SAMPLE_TIME2_Msk) >> SAR_SAMPLE_TIME23_SAMPLE_TIME2_Pos,
        (obj->base->SAMPLE_TIME23 & SAR_SAMPLE_TIME23_SAMPLE_TIME3_Msk) >> SAR_SAMPLE_TIME23_SAMPLE_TIME3_Pos,
    };

    uint32_t total_sample_time_ns = 0;

    for(uint8_t i = 0; i < CY_SAR_SEQ_NUM_CHANNELS; ++i)
    {
        if(0u == (obj->base->CHAN_EN & 1u << i))
        {
            continue;
        }
        uint8_t sample_time_idx =
            (obj->base->CHAN_CONFIG[i] & SAR_CHAN_CONFIG_SAMPLE_TIME_SEL_Msk) >> SAR_CHAN_CONFIG_SAMPLE_TIME_SEL_Pos;
        /* Per the register map, the register value is one more than the actual cycle number. */
        uint32_t sample_cycles = sample_timer[sample_time_idx] - 1;
        uint32_t total_cycles = sample_cycles + _CYHAL_ADC_CONVERSION_CYCLES;
        uint32_t sample_time_ns = total_cycles * clock_period_ns;
        sample_time_ns *= _cyhal_adc_get_average_count(obj, i);
        total_sample_time_ns += sample_time_ns;
    }

    uint32_t sample_frequency_hz = (total_sample_time_ns > 0)
        ? _CYHAL_UTILS_NS_PER_SECOND / total_sample_time_ns
        : 0;
    return sample_frequency_hz;
}

cy_rslt_t cyhal_adc_set_sample_rate(cyhal_adc_t* obj, uint32_t desired_sample_rate_hz, uint32_t* achieved_sample_rate_hz)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    /* If we don't own the clock, the caller needs to adjust it and/or the acquisition times to achive the desired rate */
    if(obj->dedicated_clock)
    {
        uint32_t desired_hz = _cyhal_adc_calc_optimal_clock_rate(obj, desired_sample_rate_hz);
        result = cyhal_clock_set_frequency(&(obj->clock), desired_hz, NULL);
    }

    if(CY_RSLT_SUCCESS == result)
    {
        result = _cyhal_adc_populate_acquisition_timers(obj);
    }

    if(CY_RSLT_SUCCESS == result)
    {
        *achieved_sample_rate_hz = _cyhal_adc_compute_actual_sample_rate(obj);
    }
    else
    {
        *achieved_sample_rate_hz = 0u;
    }
    return result;
}

/*******************************************************************************
*       ADC Channel HAL Functions
*******************************************************************************/

uint32_t _cyhal_adc_channel_convert_config(const cyhal_adc_channel_config_t* config, const cyhal_adc_t* adc,
                                            cyhal_gpio_t vplus, cyhal_gpio_t vminus)
{
    uint32_t result =
          _BOOL2FLD(SAR_CHAN_CONFIG_AVG_EN, config->enable_averaging)
        | _VAL2FLD(SAR_CHAN_CONFIG_SAMPLE_TIME_SEL, 0u); /* Placeholder, will be updated by populate_acquisition_timers */
#if defined(CY_IP_M0S8PASS4A_INSTANCES)
        CY_UNUSED_PARAMETER(vminus); // On M0S8, vminus is implied by vplus
        result |= _cyhal_adc_get_pin_addr(vplus);
        bool resolution_override = (adc->resolution != _CYHAL_ADC_RESOLUTION);
        result |= _VAL2FLD(SAR_CHAN_CONFIG_RESOLUTION, (resolution_override ? CY_SAR_SUB_RES : CY_SAR_MAX_RES));
        result |= _BOOL2FLD(SAR_CHAN_CONFIG_DIFFERENTIAL_EN, NC != vminus);
#else
        CY_UNUSED_PARAMETER(adc); // MXS40 doesn't support resolution override, so ADC is not used
        result |= _cyhal_adc_get_pin_addr(vplus, true);
        if(vminus == NC)
        {
            /* Single-ended channel */
            result |= (uint32_t)CY_SAR_CHAN_SINGLE_ENDED;
        }
        else
        {
            /* Differential */
            result |= _cyhal_adc_get_pin_addr(vminus, false);
            result |= (uint32_t)CY_SAR_CHAN_DIFFERENTIAL_UNPAIRED;
        }
#endif

    return result;
}

static void _cyhal_adc_update_chan_offset(cyhal_adc_channel_t* obj)
{
    /* Normally, the PDL sets the offset in the ADC init. But we change the channel config after we initialize
     * the ADC itself, so we need to set the offset appropriately here. Otherwise the _uv functions will not
     * work correctly.
     * The conditions in the PDL are: singleEnded && vrefNegSelect && singleEndedSigned. We always operate
     * in signed mode so we only need to check the first two.
    */
    bool single_ended = (CYHAL_ADC_VNEG == obj->vminus);
    uint32_t neg_sel_vref_val = (uint32_t)CY_SAR_NEG_SEL_VREF;
#if defined(CY_IP_M0S8PASS4A_INSTANCES)
    // The NEG_SEL values in the M0S8 pdl are not pre-shifted
    neg_sel_vref_val = neg_sel_vref_val << SAR_CTRL_NEG_SEL_Pos;
#endif
    bool neg_sel_vref = (neg_sel_vref_val == (obj->adc->base->CTRL & SAR_CTRL_NEG_SEL_Msk));
    int16_t offset = (single_ended && neg_sel_vref) ? (-1 * ((int16_t) (CY_SAR_WRK_MAX_12BIT / 2))) : 0;

#if defined(CY_IP_MXS40PASS_SAR_INSTANCES) && CY_IP_MXS40PASS_SAR_INSTANCES < 2
    Cy_SAR_SetOffset(obj->channel_idx, offset);
#else
    Cy_SAR_SetChannelOffset(obj->adc->base, obj->channel_idx, offset);
#endif
}

