ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/mtb-hal-cat1/source/cyhal_adc.c
cy_rslt_t cyhal_adc_channel_init_diff(cyhal_adc_channel_t *obj, cyhal_adc_t* adc, cyhal_gpio_t vplus, cyhal_gpio_t vminus, const cyhal_adc_channel_config_t* cfg)
{
    CY_ASSERT(obj != NULL);
    CY_ASSERT(adc != NULL);

    const uint32_t CYHAL_ADC_MIN_ACQUISITION_TIME_NS = 167;

    cy_rslt_t result = CY_RSLT_SUCCESS;

    memset(obj, 0, sizeof(cyhal_adc_channel_t));
    obj->vplus = NC;
    obj->vminus = NC;

    // Check for invalid pin or pin belonging to a different SAR
    const cyhal_resource_pin_mapping_t *vplus_map = _cyhal_adc_find_matching_resource(&(adc->resource), vplus,
        cyhal_pin_map_pass_sarmux_pads, sizeof(cyhal_pin_map_pass_sarmux_pads)/sizeof(cyhal_pin_map_pass_sarmux_pads[0]));
    const cyhal_resource_pin_mapping_t *vminus_map = NULL;

    if(NULL == vplus_map)
    {
        result = CYHAL_ADC_RSLT_BAD_ARGUMENT;
    }

    if(CY_RSLT_SUCCESS == result && CYHAL_ADC_VNEG != vminus)
    {
        vminus_map = _cyhal_adc_find_matching_resource(&(adc->resource), vminus, cyhal_pin_map_pass_sarmux_pads,
            sizeof(cyhal_pin_map_pass_sarmux_pads)/sizeof(cyhal_pin_map_pass_sarmux_pads[0]));
        if (NULL == vminus_map)
        {
            result = CYHAL_ADC_RSLT_BAD_ARGUMENT;
        }
    }

    if(CY_RSLT_SUCCESS == result)
    {
        result = _cyhal_utils_reserve_and_connect(vplus, vplus_map);
    }

    if(CY_RSLT_SUCCESS == result)
    {
        obj->vplus = vplus;
        if(CYHAL_ADC_VNEG != vminus)
        {
            result = _cyhal_utils_reserve_and_connect(vminus, vminus_map);
        }
    }

    uint8_t chosen_channel = 0;

    if (CY_RSLT_SUCCESS == result)
    {
        obj->vminus = vminus;

        // Find the first available channel
        for(chosen_channel = 0; chosen_channel < CY_SAR_SEQ_NUM_CHANNELS; ++chosen_channel)
        {
            if(NULL == adc->channel_config[chosen_channel])
            {
                break;
            }
        }
        if (chosen_channel >= CY_SAR_SEQ_NUM_CHANNELS) // No channels available
            result = CYHAL_ADC_RSLT_NO_CHANNELS;
    }

    if(CY_RSLT_SUCCESS == result)
    {
        // Don't set the ADC until here so that free knows whether we have allocated
        // the channel on the parent ADC instance (and therefore doesn't try to free it if
        // something fails further up)
        obj->adc = adc;
        obj->channel_idx = chosen_channel;
        obj->adc->channel_config[chosen_channel] = obj;
        obj->minimum_acquisition_ns = (cfg->min_acquisition_ns > CYHAL_ADC_MIN_ACQUISITION_TIME_NS)
                                       ? cfg->min_acquisition_ns : CYHAL_ADC_MIN_ACQUISITION_TIME_NS;
    }

    if(CY_RSLT_SUCCESS == result)
    {
        result = _cyhal_adc_populate_acquisition_timers(obj->adc);
    }

    if(CY_RSLT_SUCCESS == result)
    {
        uint32_t fw_ctrl_plus = _cyhal_adc_get_fw_switch_control(vplus, true);
        uint32_t mux_ctrl_plus = _cyhal_adc_get_mux_switch_control(vplus);

        _CYHAL_ADC_SET_SWITCH(obj->adc->base, fw_ctrl_plus, true);
        Cy_SAR_SetSwitchSarSeqCtrl(obj->adc->base, mux_ctrl_plus, _CYHAL_ADC_SARSEQ_STATE(true));

        if(CYHAL_ADC_VNEG != vminus)
        {
            uint32_t fw_ctrl_minus = _cyhal_adc_get_fw_switch_control(vminus, false);
            uint32_t mux_ctrl_minus = _cyhal_adc_get_mux_switch_control(vminus);

            _CYHAL_ADC_SET_SWITCH(obj->adc->base, fw_ctrl_minus, true);
            Cy_SAR_SetSwitchSarSeqCtrl(obj->adc->base, mux_ctrl_minus, _CYHAL_ADC_SARSEQ_STATE(true));
        }

        result = cyhal_adc_channel_configure(obj, cfg);
    }

    if(CY_RSLT_SUCCESS != result)
    {
        cyhal_adc_channel_free(obj);
    }

    return result;
}

cy_rslt_t cyhal_adc_channel_configure(cyhal_adc_channel_t *obj, const cyhal_adc_channel_config_t *config)
{
    CY_ASSERT(NULL != obj);

    obj->adc->base->CHAN_CONFIG[obj->channel_idx] = _cyhal_adc_channel_convert_config(config, obj->adc, obj->vplus, obj->vminus);
    if(config->enabled)
    {
        obj->adc->base->CHAN_EN |= 1u << obj->channel_idx;
    }
    else
    {
        obj->adc->base->CHAN_EN &= ~(1u << obj->channel_idx);
    }
    _cyhal_adc_update_chan_offset(obj);
    return _cyhal_adc_populate_acquisition_timers(obj->adc);
}

void cyhal_adc_channel_free(cyhal_adc_channel_t *obj)
{
    if(obj->adc != NULL)
    {
        // Disable the channel, the unconfigure it
        obj->adc->channel_config[obj->channel_idx] = NULL;

        if(NC != obj->vplus)
        {
            uint32_t fw_ctrl_plus = _cyhal_adc_get_fw_switch_control(obj->vplus, true);
            uint32_t mux_ctrl_plus = _cyhal_adc_get_mux_switch_control(obj->vplus);

            _CYHAL_ADC_SET_SWITCH(obj->adc->base, fw_ctrl_plus, false);
            Cy_SAR_SetSwitchSarSeqCtrl(obj->adc->base, mux_ctrl_plus, _CYHAL_ADC_SARSEQ_STATE(false));
        }

        if(NC != obj->vminus)
        {
            uint32_t mux_ctrl_minus = _cyhal_adc_get_mux_switch_control(obj->vminus);
            uint32_t fw_ctrl_minus = _cyhal_adc_get_fw_switch_control(obj->vminus, false);

            _CYHAL_ADC_SET_SWITCH(obj->adc->base, fw_ctrl_minus, false);
            Cy_SAR_SetSwitchSarSeqCtrl(obj->adc->base, mux_ctrl_minus, _CYHAL_ADC_SARSEQ_STATE(false));
        }
        obj->adc->base->CHAN_CONFIG[obj->channel_idx] = 0;
        obj->adc = NULL;
    }

    _cyhal_utils_release_if_used(&(obj->vplus));
    _cyhal_utils_release_if_used(&(obj->vminus));
}

uint16_t cyhal_adc_read_u16(const cyhal_adc_channel_t *obj)
{
#if defined(CY_IP_M0S8PASS4A_INSTANCES)
    const uint8_t RESULT_SCALING_FACTOR = UINT16_MAX / ((1 << obj->adc->resolution) - 1); // 12-bit SAR resolution
#else
    const uint8_t RESULT_SCALING_FACTOR = UINT16_MAX / 0xFFF; // constant 12-bit SAR resolution
#endif
    int32_t signed_result = cyhal_adc_read(obj);
    /* Legacy API for BWC. Convert from signed to unsigned by adding 0x800 to
     * convert the lowest signed 12-bit number to 0x0.
     */
    uint16_t unsigned_result = (uint16_t)(signed_result + 0x800);
    /* The SAR provides a 12-bit result, but this API is defined to fill a full 16-bit range */
    uint16_t scaled_result = unsigned_result * RESULT_SCALING_FACTOR;
    return scaled_result;
}

